package week2;

public class Coffee {
    // Атрибутите се дефинират като
    // <достъп> <тип> <име> = [<стойност>];
    private String brand;
    private double price;
    
    // get - методите се дефинират, за да можем да вземем стойностите на променливите, които са private
    public String getBrand() {
        return brand;
    }
    // set - методите се дефинират, за да може да се променя стойността на private променливите.
    // Тези методи са важни, защото в тях може да се сложи някаква валидация на входните данни.
    // Ако например стойностите на атрибута трябва да са от 0 до 100 - тук можем да проверим, дали стойността,
    // която се подава отговаря на нашите условия. Ако не отговаря - да не я задаваме.
    // Ако атрибута е public - няма как да нарпавим подобна валидация при промяна.
    public void setBrand(String brand) {
        this.brand = brand;
    }
    
    public double getPrice() {
        return price;
    }
    // ползва се void тип, защото този метод не връща никакъв резултат, а просто set-ва стойностите
    public void setPrice(double price) {
        this.price = price;
    }
    
    // Този метод се наследява от Objects. Когато не е предефиниран (дефиниран в този клас) - при print се извиква
    // метода от Objects
    // Ако искаме да зададем какво точно ще се показва при принтиране - трябва да си дефинираме този метод в нашия клас
    // и в него да опишем точно каква стойност да се принтира.
    public String toString() {
        return brand + " " + price;
    }
}
